Revit 2027 API
BuiltInFailures.GridFailures.GridlineAxisTooClose Property
 Axis of gridlines should not change order or be closer than [Value] to each other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlineAxisTooClose { get; }
Public Shared ReadOnly Property GridlineAxisTooClose As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlineAxisTooClose {
	FailureDefinitionId^ get ();
}
static member GridlineAxisTooClose : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridFailures Class
Autodesk.Revit.DB Namespace